### 2888. Reshape Data: Concatenate

**DataFrame: df1**
| Column Name | Type   |
|-------------|--------|
| student_id  | int    |
| name        | object |
| age         | int    |

**DataFrame: df2**
| Column Name | Type   |
|-------------|--------|
| student_id  | int    |
| name        | object |
| age         | int    |

Write a solution to concatenate these two DataFrames vertically into one DataFrame.

The result format is in the following example.

#### Example 1:

**Input:**
df1

| student_id | name    | age |
|------------|---------|-----|
| 1          | Mason   | 8   |
| 2          | Ava     | 6   |
| 3          | Taylor  | 15  |
| 4          | Georgia | 17  |

df2

| student_id | name | age |
|------------|------|-----|
| 5          | Leo  | 7   |
| 6          | Alex | 7   |

**Output:**

| student_id | name    | age |
|------------|---------|-----|
| 1          | Mason   | 8   |
| 2          | Ava     | 6   |
| 3          | Taylor  | 15  |
| 4          | Georgia | 17  |
| 5          | Leo     | 7   |
| 6          | Alex    | 7   |

**Explanation:**
The two DataFrames are stacked vertically, and their rows are combined.

In [1]:
import pandas as pd

def concatenateTables(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    return pd.concat([df1,df2])

In [2]:
data1 = [
    {"student_id": 1, "name": "Mason", "age": 8},
    {"student_id": 2, "name": "Ava", "age": 6},
    {"student_id": 3, "name": "Taylor", "age": 15},
    {"student_id": 4, "name": "Georgia", "age": 17}
]

df1 = pd.DataFrame(data1)

data2 = [
    {"student_id": 5, "name": "Leo", "age": 7},
    {"student_id": 6, "name": "Alex", "age": 7}
]

df2 = pd.DataFrame(data2)

In [3]:
concatenateTables(df1, df2)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
0           5      Leo    7
1           6     Alex    7